app/views/urls/edit.html.erb

    e.preventDefault();
    if(document.getElementById("url_name").value.length>0 && document.getElementById("long_url").value.length>0)
---
SELECT "urls"."url_name" FROM "urls" WHERE (id='1')