app/views/urls/index.html.erb

            <td><%= link_to url.short_url, url.short_url %></td>
            <td><%= link_to url.long_url.length>30 ? url.long_url.first(30)+"..." :url.long_url.first(30) , url.long_url %></td>
---
SELECT "urls".* FROM "urls" ORDER BY updated_at DESC