app/controllers/urls_controller.rb

  def index
    @urls = Url.all.order('updated_at DESC')
---
SELECT "urls".* FROM "urls" ORDER BY updated_at DESC

  def create
    @url = Url.new(url_params)
    @url.short_url = @@redirect_base_url+@url.generate_short_url
    if @url.save
---
INSERT INTO "urls" ("url_name", "long_url", "short_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def edit
    @url = Url.where("id=?",params[:id])
    @url_name = @url.pluck(:url_name)[0]
    @long_url = @url.pluck(:long_url)[0]
---
SELECT "urls"."url_name" FROM "urls" WHERE (id='2')
SELECT "urls"."long_url" FROM "urls" WHERE (id='2')

  def edit_url
    update_url = Url.find_by(id: params[:id])
    if update_url.update(url_name: params[:url_name], long_url: params[:long_url] )
---
SELECT  "urls".* FROM "urls" WHERE "urls"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "urls" SET "url_name" = $1, "long_url" = $2, "updated_at" = $3 WHERE "urls"."id" = $4  [["url_name", "Flipkart"], ["long_url", "https://www.flipkart.com/pages/ewaste-compliance-tnc?otracker=undefined_footer"], ["updated_at", "2021-11-23 12:37:07.588174"], ["id", 1]]

  def delete
    delete_url = Url.find_by(id: params[:id])
    if delete_url.destroy
---
SELECT  "urls".* FROM "urls" WHERE "urls"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "urls" WHERE "urls"."id" = $1  [["id", 1]]